app/controllers/tweets_controller.rb

INSERT INTO `tweets` (`created_at`, `updated_at`, `body`) VALUES ('2021-01-06 09:12:48.240946', '2021-01-06 09:12:48.240946', 'あけおめ')
---
    def create
        @tweet = Tweet.new(tweet_params)
        if @tweet.save

SELECT `tweets`.* FROM `tweets`
---
    def index
      @tweets = Tweet.all

SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = NULL LIMIT 1
---
    def show
      @tweet = Tweet.find(params[:id])

SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 1 LIMIT 1
UPDATE `tweets` SET `tweets`.`body` = '今日は雨　雷も鳴ってる', `tweets`.`updated_at` = '2020-08-30 04:45:38.902092' WHERE `tweets`.`id` = 2
---
    def update
      @tweet = Tweet.find(params[:id])
      if @tweet.update(tweet_params)

DELETE FROM `tweets` WHERE `tweets`.`id` = 1
SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 1 LIMIT 1
---
    def destroy
      Tweet.find(params[:id]).destroy